In [3]:
import numpy as np
import pandas as pd

In [4]:
data = {"Name": ["hamza","Ali","Ahmed"],
        "Marks":[98,54,58,],
        "Grade":["A+","B","B"]

       }

In [5]:
df = pd.DataFrame(data)
df

    Name  Marks Grade
0  hamza     98    A+
1    Ali     54     B
2  Ahmed     58     B

In [6]:
df.describe()

          Marks
count   3.00000
mean   70.00000
std    24.33105
min    54.00000
25%    56.00000
50%    58.00000
75%    78.00000
max    98.00000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Marks   3 non-null      int64
 2   Grade   3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [8]:
trainshedule ={
    "Train NO":["sir syed express","tazz gam","awami express","pakistan railways","pashwar coach"],
    "speed": [65,66,76,78,65],
    "city":["karachi","Islamabad","Lahore","multan","sargodha"]
}

df1 = pd.DataFrame(trainshedule)
df1

            Train NO  speed       city
0   sir syed express     65    karachi
1           tazz gam     66  Islamabad
2      awami express     76     Lahore
3  pakistan railways     78     multan
4      pashwar coach     65   sargodha

In [9]:
df1.to_csv("train-shedule.csv",index =False)

In [10]:
hamza =pd.read_csv("train-shedule.csv")

In [11]:
hamza

            Train NO  speed       city
0   sir syed express     65    karachi
1           tazz gam     66  Islamabad
2      awami express     76     Lahore
3  pakistan railways     78     multan
4      pashwar coach     65   sargodha

In [12]:
hamza["Train NO"]

0     sir syed express
1             tazz gam
2        awami express
3    pakistan railways
4        pashwar coach
Name: Train NO, dtype: object

In [13]:
hamza["speed"][1] = 90

C:\Users\HAMZA ABBAS\AppData\Local\Temp\ipykernel_14100\1024057290.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hamza["speed"][1] = 90

In [14]:
hamza

            Train NO  speed       city
0   sir syed express     65    karachi
1           tazz gam     90  Islamabad
2      awami express     76     Lahore
3  pakistan railways     78     multan
4      pashwar coach     65   sargodha

In [15]:
hamza.index=["a","b","c","d","e"]

In [16]:
hamza

            Train NO  speed       city
a   sir syed express     65    karachi
b           tazz gam     90  Islamabad
c      awami express     76     Lahore
d  pakistan railways     78     multan
e      pashwar coach     65   sargodha

In [17]:
newdf = pd.DataFrame(np.random.rand(334,5),index = np.arange(334))

In [18]:
newdf.head(6)

          0         1         2         3         4
0  0.233615  0.078624  0.889691  0.148843  0.457176
1  0.902637  0.383699  0.983465  0.807020  0.218156
2  0.169947  0.625596  0.382281  0.222632  0.683530
3  0.101384  0.464072  0.821338  0.225780  0.676314
4  0.060564  0.979403  0.272693  0.790301  0.056256
5  0.087110  0.810635  0.791877  0.077433  0.838169

In [19]:
newdf.columns =list("ABCDE")

In [20]:
newdf

            A         B         C         D         E
0    0.233615  0.078624  0.889691  0.148843  0.457176
1    0.902637  0.383699  0.983465  0.807020  0.218156
2    0.169947  0.625596  0.382281  0.222632  0.683530
3    0.101384  0.464072  0.821338  0.225780  0.676314
4    0.060564  0.979403  0.272693  0.790301  0.056256
..        ...       ...       ...       ...       ...
329  0.599452  0.875017  0.367471  0.786938  0.696662
330  0.415779  0.818267  0.658153  0.956083  0.663642
331  0.445197  0.754753  0.722473  0.405522  0.094281
332  0.237295  0.323005  0.816622  0.942244  0.541248
333  0.123289  0.818369  0.878061  0.007160  0.324715

[334 rows x 5 columns]

In [21]:
newdf.loc[4,"A"] =99999

In [22]:
newdf.head()

              A         B         C         D         E
0      0.233615  0.078624  0.889691  0.148843  0.457176
1      0.902637  0.383699  0.983465  0.807020  0.218156
2      0.169947  0.625596  0.382281  0.222632  0.683530
3      0.101384  0.464072  0.821338  0.225780  0.676314
4  99999.000000  0.979403  0.272693  0.790301  0.056256

In [23]:
rgfdata = newdf.copy()

In [24]:
rgfdata.head()

              A         B         C         D         E
0      0.233615  0.078624  0.889691  0.148843  0.457176
1      0.902637  0.383699  0.983465  0.807020  0.218156
2      0.169947  0.625596  0.382281  0.222632  0.683530
3      0.101384  0.464072  0.821338  0.225780  0.676314
4  99999.000000  0.979403  0.272693  0.790301  0.056256

In [26]:
rgfdata.iloc[4,1] =0.98

In [27]:
rgfdata.head()

              A         B         C         D         E
0      0.233615  0.078624  0.889691  0.148843  0.457176
1      0.902637  0.383699  0.983465  0.807020  0.218156
2      0.169947  0.625596  0.382281  0.222632  0.683530
3      0.101384  0.464072  0.821338  0.225780  0.676314
4  99999.000000  0.980000  0.272693  0.790301  0.056256

In [28]:
newdf

                A         B         C         D         E
0        0.233615  0.078624  0.889691  0.148843  0.457176
1        0.902637  0.383699  0.983465  0.807020  0.218156
2        0.169947  0.625596  0.382281  0.222632  0.683530
3        0.101384  0.464072  0.821338  0.225780  0.676314
4    99999.000000  0.979403  0.272693  0.790301  0.056256
..            ...       ...       ...       ...       ...
329      0.599452  0.875017  0.367471  0.786938  0.696662
330      0.415779  0.818267  0.658153  0.956083  0.663642
331      0.445197  0.754753  0.722473  0.405522  0.094281
332      0.237295  0.323005  0.816622  0.942244  0.541248
333      0.123289  0.818369  0.878061  0.007160  0.324715

[334 rows x 5 columns]

In [29]:
rgfdata.loc[4,"A"] =0.98

In [30]:
rgfdata.head()

          A         B         C         D         E
0  0.233615  0.078624  0.889691  0.148843  0.457176
1  0.902637  0.383699  0.983465  0.807020  0.218156
2  0.169947  0.625596  0.382281  0.222632  0.683530
3  0.101384  0.464072  0.821338  0.225780  0.676314
4  0.980000  0.980000  0.272693  0.790301  0.056256

In [31]:
new=rgfdata.loc[:,["A","B"]]

In [32]:
new

            A         B
0    0.233615  0.078624
1    0.902637  0.383699
2    0.169947  0.625596
3    0.101384  0.464072
4    0.980000  0.980000
..        ...       ...
329  0.599452  0.875017
330  0.415779  0.818267
331  0.445197  0.754753
332  0.237295  0.323005
333  0.123289  0.818369

[334 rows x 2 columns]

In [33]:
new=new.loc[(new["A"]<0.1)]

In [34]:
new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 33 entries, 5 to 317
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       33 non-null     float64
 1   B       33 non-null     float64
dtypes: float64(2)
memory usage: 792.0 bytes

In [35]:
new.count()

A    33
B    33
dtype: int64

In [36]:
new.shape

(33, 2)

In [ ]:
new

In [ ]:
rgfdata

In [ ]:
rgfdata.loc[0,"A"]

In [ ]:
rgfdata.iloc[[0,4],[1,2]]

In [ ]:
rgfdata

In [ ]:
rgfdata.drop(["A"],axis=1)

In [ ]:
rgfdata.drop(["A"],axis=1,inplace=True)

In [ ]:
rgfdata = rgfdata.drop(["C"],axis=1)

In [ ]:
rgfdata

In [ ]:
rgfdata.reset_index(drop=True,inplace=True)

In [ ]:
rgfdata.head()

In [ ]:
rgfdata["D"]

In [ ]:
rgfdata.info()

In [ ]:
rgfdata["D"].isnull()

In [ ]:

# create a sample DataFrame with duplicate rows
data = {'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'David'],
        'Age': [25, 30, 35, 25, 40],
        'City': ['New York', 'London', 'Paris', 'New York', 'Sydney']}
df = pd.DataFrame(data)

df

In [ ]:
# identify duplicate rows
duplicates = df.duplicated()

In [ ]:
duplicates

In [ ]:
num_duplicates = duplicates.sum()

In [ ]:
duplicates

In [ ]:
df

In [ ]:
df.drop_duplicates(subset=["Name"],inplace=True)

In [ ]:
df

In [ ]:
rgfdata

In [ ]:
rgfdata.head(4)

In [ ]:
rgfdata.loc[1,"D"] =0.458055

In [ ]:
rgfdata.head(4)

In [ ]:
rgfdata=rgfdata["D"].value_counts(dropna=False)

In [ ]:
print(len(rgfdata["D"]))

In [ ]:
rgfdata